#include "basgfx6.h"

// la codifica л CP 852

font __basfnt = {
    "BASFNT",
    {
        {
            'a',    
            (char *[]){ "лллл", "л  л", "лллл", "л  л", "л  л"}
        },
        {
            'b',
            (char *[]){ "лллл", "л  л", "ллл ", "л  л", "лллл"}
        },
        {
            'c',
            (char *[]){ "лллл", "л   ", "л   ", "л   ", "лллл"}
        },
        {
            'd',
            (char *[]){ "ллл ", "л  л", "л  л", "л  л", "ллл "}
        },
        {
            'e',
            (char *[]){ "лллл", "л   ", "ллл ", "л   ", "лллл"}
        },
        {
            'f',
            (char *[]){ "лллл", "л   ", "ллл ", "л   ", "л   "}
        },
        {
            'g',
            (char *[]){ "лллл", "л   ", "л лл", "л  л", "лллл"}
        },
        {
            'h',
            (char *[]){ "л  л", "л  л", "лллл", "л  л", "л  л"}
        },
        {
            'i',
            (char *[]){ " лл ", "    ", " лл ", " лл ", " лл "}
        },
        {  
            'j',
            (char *[]){ "лллл", "  л ", "  л ", "  л ", " л  "}
        },
        {  
            'k',
            (char *[]){ "л  л", "л л ", "лл  ", "л л ", "л  л"}
        },
        {  
            'l',
            (char *[]){ "л   ", "л   ", "л   ", "л   ", "лллл"}
        },
        {        
            'm',
            (char *[]){ "л  л", "лллл", "л  л", "л  л", "л  л"}
        },
        {  
            'n',
            (char *[]){ "л  л", "лл л", "л лл", "л  л", "л  л"}
        },
        {  
            'o',
            (char *[]){ "лллл", "л  л", "л  л", "л  л", "лллл"}
        },
        {   
            'p',
            (char *[]){ "лллл", "л  л", "лллл", "л   ", "л   "}
        },
        {  
            'q',
            (char *[]){ "лллл", "л  л", "л  л", "лллл", "  л "}
        },
        {  
            'r',
            (char *[]){ "лллл", "л  л", "лллл", "л л ", "л  л"}
        },
        {  
            's',
            (char *[]){ " ллл", "л   ", " ллл", "   л", "ллл "}
        },
        {         
            't',
            (char *[]){ "лллл", " лл ", " лл ", " лл ", " лл "}
        },
        {  
            'u',
            (char *[]){ "л  л", "л  л", "л  л", "л  л", "лллл"}
        },
        {   
            'v',
            (char *[]){ "л  л", "л  л", "л  л", " лл ", " лл "}
        },
        {       
            'x',
            (char *[]){ "л  л", " лл ", " лл ", " лл ", "л  л"}
        },
        {   
            'w',
            (char *[]){ "л  л", "л  л", "лллл", "лллл", " лл "}
        },
        { 
            'y',
            (char *[]){ "л  л", "л  л", " лл ", " лл ", " лл "}
        },
        {  
            'z',
            (char *[]){ "лллл", "   л", "лллл", "л   ", "лллл"}
        },
        {         
            '0',
            (char *[]){ "лллл", "л лл", "л лл", "лл л", "лллл"}
        },
        {
            '1',
            (char *[]){ " лл ", "л л ", "  л ", "  л ", "лллл"}
        },
        {
            '2',
            (char *[]){ "лллл", "   л", " ллл", "л   ", "лллл"}
        },
        {        
            '3',
            (char *[]){ "лллл", "   л", " ллл", "   л", "лллл"}
        },
        {    
            '4',
            (char *[]){ "л  л", "л  л", "лллл", "   л", "   л"}
        },
        {    
            '5',
            (char *[]){ "лллл", "л   ", "лллл", "   л", "лллл"}
        },
        {       
            '6',
            (char *[]){ "лллл", "л   ", "лллл", "л  л", "лллл"}
        },
        {        
            '7',
            (char *[]){ "лллл", "   л", "   л", "   л", "   л"}
        },
        {    
            '8',
            (char *[]){ "лллл", "л  л", "лллл", "л  л", "лллл"}
        },
        {    
            '9',
            (char *[]){ "лллл", "л  л", "лллл", "   л", "лллл"}
        },
        {    
            ',',
            (char *[]){ "    ", "    ", "    ", "  л ", " л  "}
        },
        {
            '.',
            (char *[]){ "    ", "    ", "    ", "    ", " лл "}
        },
        {
            ':',
            (char *[]){ "    ", "    ", "  л ", "    ", "  л "}
        },
        {    
            ';',
            (char *[]){ "    ", "  л ", "    ", "  л ", " л  "}
        },
        {
            '-',
            (char *[]){ "    ", "    ", "ллл ", "    ", "    "}
        },
        {
            '_',
            (char *[]){ "    ", "    ", "    ", "    ", "лллл"}
        },
        {    
            '"',
            (char *[]){ " л л", "л л ", "    ", "    ", "    "}
        },
        {
            '\'',
            (char *[]){ "  л ", "  л ", "    ", "    ", "    "}
        },
        {
            '/',
            (char *[]){ "   л", "  л ", "  л ", " л  ", "л   "}
        },
        {    
            '!',
            (char *[]){ " л  ", " л  ", " л  ", "    ", " л  "}
        },
        {
            'л',
            (char *[]){ "лллл", "л  л", "  л ", "    ", "  л "}
        },
        {
            '(',
            (char *[]){ "   л", "  л ", "  л ", "  л ", "   л"}
        },
        {
            ')',
            (char *[]){ "л   ", " л  ", " л  ", " л  ", "л   "}
        },
        {
            '\\',
            (char *[]){ "л   ", " л  ", " л  ", "  л ", "   л"}
        },
        {
            '|',
            (char *[]){ " л  ", " л  ", " л  ", " л  ", " л  "}
        },
        {
            '=',
            (char *[]){ "    ", "лллл", "    ", "лллл", "    "}
        },
        {
            '+',
            (char *[]){ "    ", " лл ", "лллл", " лл ", "    "}
        }
    },
    
    5,
    4
};
